CSI API ETABS v1

# cSpandrelLabel Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cSpandrelLabel

    Public Interface cSpandrelLabel

    Dim instance As cSpandrelLabel

    public interface class cSpandrelLabel

    type cSpandrelLabel =  interface end

The cSpandrelLabel type exposes the following members.

Methods

| Name| Description
---|---|---
|
ChangeName|  Changes the name of a
defined Spandrel Label
| [Delete](0370d4f5-a0de-
fafb-1edb-91b59a210285.htm)|  Deletes the specified Spandrel Label
|
GetNameList|  Retrieves the names
of all defined Spandrel Labels
|
GetSectionProperties|  Retrieves
the section properties for a specified spandrel
|
GetSpandrel|  Retrieves the
specified Spandrel Label
|
SetSpandrel|  Adds a new Spandrel
Label, or modifies an existing Spandrel Label
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com